Reports/ПланыДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>ПланыДвиженияДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ПланыДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>ПланыДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВалютаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыДвиженийПриходРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийПриходРасход</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПланыДвиженияДенежныхСредств/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	 УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	
	// Описание исходного текста запроса.
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвиженияДенежныхСредствОбороты.Сценарий КАК Сценарий,
	|	ДвиженияДенежныхСредствОбороты.ВидДенежныхСредств КАК ВидДенежныхСредств,
	|	ДвиженияДенежныхСредствОбороты.ПриходРасход КАК ПриходРасход,
	|	ДвиженияДенежныхСредствОбороты.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
	|	ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДвиженияДенежныхСредствОбороты.Проект КАК Проект,
	|	ДвиженияДенежныхСредствОбороты.Контрагент КАК Контрагент,
	|	ДвиженияДенежныхСредствОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДвиженияДенежныхСредствОбороты.Сделка КАК Сделка,
	|	ДвиженияДенежныхСредствОбороты.ДокументПланирования КАК ДокументПланирования,
	|	ДвиженияДенежныхСредствОбороты.ДокументПланирования.Подразделение КАК Подразделение,
	|	ДвиженияДенежныхСредствОбороты.Регистратор КАК Регистратор,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.Сценарий) КАК СценарийПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.ВидДенежныхСредств) КАК ВидДенежныхСредствПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.ПриходРасход) КАК ПриходРасходПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.ВалютаДенежныхСредств) КАК ВалютаДенежныхСредствПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредствПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.Проект) КАК ПроектПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.Контрагент) КАК КонтрагентПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.ДоговорКонтрагента) КАК ДоговорКонтрагентаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.Сделка) КАК СделкаПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.ДокументПланирования) КАК ДокументПланированияПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.ДокументПланирования.Подразделение) КАК ПодразделениеПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ДвиженияДенежныхСредствОбороты.Регистратор) КАК РегистраторПредставление,
	|	ДвиженияДенежныхСредствОбороты.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ГОД) КАК ПериодГод,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриходВал,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходВал,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныйПотокВал,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриходУпр,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходУпр,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныйПотокУпр
	|	//ПОЛЯ_СВОЙСТВА
	|	//ПОЛЯ_КАТЕГОРИИ
	|{ВЫБРАТЬ
	|	Сценарий.*,
	|	ВидДенежныхСредств.*,
	|	ПриходРасход.*,
	|	ВалютаДенежныхСредств.*,
	|	СтатьяДвиженияДенежныхСредств.*,
	|	Проект.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	ДокументПланирования.*,
	|	Подразделение.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	СуммаПриходВал,
	|	СуммаРасходВал,
	|	ДенежныйПотокВал,
	|	СуммаПриходУпр,
	|	СуммаРасходУпр,
	|	ДенежныйПотокУпр
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}
	|ИЗ
	|	РегистрНакопления.ПланыДвиженияДенежныхСредств.Обороты(&ДатаНач, &ДатаКон, Регистратор {&Периодичность}, {Сценарий.* КАК Сценарий, ВидДенежныхСредств.* КАК ВидДенежныхСредств, ПриходРасход.* КАК ПриходРасход, ВалютаДенежныхСредств.* КАК ВалютаДенежныхСредств, СтатьяДвиженияДенежныхСредств.* КАК СтатьяДвиженияДенежныхСредств, Проект.* КАК Проект, Контрагент.* КАК Контрагент, ДоговорКонтрагента.* КАК ДоговорКонтрагента, Сделка.* КАК Сделка, ДокументПланирования.* КАК ДокументПланирования, ДокументПланирования.Подразделение.* КАК Подразделение}) КАК ДвиженияДенежныхСредствОбороты
	|	//СОЕДИНЕНИЯ
	|{ГДЕ
	|	ДвиженияДенежныхСредствОбороты.Регистратор.* КАК Регистратор,
	|	ДвиженияДенежныхСредствОбороты.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ДЕНЬ) КАК ПериодДень,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ДЕКАДА) КАК ПериодДекада,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, МЕСЯЦ) КАК ПериодМесяц,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, КВАРТАЛ) КАК ПериодКвартал,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	|	НАЧАЛОПЕРИОДА(ДвиженияДенежныхСредствОбороты.Период, ГОД) КАК ПериодГод,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриходВал,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходВал,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныйПотокВал,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаПриходУпр,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходУпр,
	|	ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Приход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ДвиженияДенежныхСредствОбороты.ПриходРасход = &Расход
	|			ТОГДА ДвиженияДенежныхСредствОбороты.СуммаУпрОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДенежныйПотокУпр
	|	//УСЛОВИЯ_СВОЙСТВА
	|	//УСЛОВИЯ_КАТЕГОРИИ
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	Сценарий.*,
	|	ВидДенежныхСредств.*,
	|	ПриходРасход.*,
	|	ВалютаДенежныхСредств.*,
	|	СтатьяДвиженияДенежныхСредств.*,
	|	Проект.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	ДокументПланирования.*,
	|	Подразделение.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод,
	|	СуммаПриходВал,
	|	СуммаРасходВал,
	|	ДенежныйПотокВал,
	|	СуммаПриходУпр,
	|	СуммаРасходУпр,
	|	ДенежныйПотокУпр
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}	
	|ИТОГИ
	|	СУММА(СуммаПриходВал),
	|	СУММА(СуммаРасходВал),
	|	СУММА(ДенежныйПотокВал),
	|	СУММА(СуммаПриходУпр),
	|	СУММА(СуммаРасходУпр),
	|	СУММА(ДенежныйПотокУпр)
	|	//ИТОГИ_СВОЙСТВА
	|	//ИТОГИ_КАТЕГОРИИ
	|ПО
	|	ОБЩИЕ
	|{ИТОГИ ПО
	|	Сценарий.*,
	|	ВидДенежныхСредств.*,
	|	ПриходРасход.*,
	|	ВалютаДенежныхСредств.*,
	|	СтатьяДвиженияДенежныхСредств.*,
	|	Проект.*,
	|	Контрагент.*,
	|	ДоговорКонтрагента.*,
	|	Сделка.*,
	|	ДокументПланирования.*,
	|	Подразделение.*,
	|	Регистратор.*,
	|	Период,
	|	ПериодДень,
	|	ПериодНеделя,
	|	ПериодДекада,
	|	ПериодМесяц,
	|	ПериодКвартал,
	|	ПериодПолугодие,
	|	ПериодГод
	|	//ПСЕВДОНИМЫ_СВОЙСТВА
	|	//ПСЕВДОНИМЫ_КАТЕГОРИИ
	|}";	
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ДвиженияДенежныхСредствОбороты.Контрагент", "Контрагент", НСтр("ru = 'Контрагент'; uk = 'Контрагент'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Контрагенты);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ДвиженияДенежныхСредствОбороты.ДоговорКонтрагента", "ДоговорКонтрагента", НСтр("ru = 'Договор контрагента'; uk = 'Договір контрагента'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ДоговорыКонтрагентов);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ДвиженияДенежныхСредствОбороты.Сделка", "Сделка", НСтр("ru = 'Сделка'; uk = 'Угода'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);
        УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ДвиженияДенежныхСредствОбороты.ДокументПланирования", "ДокументПланирования", НСтр("ru = 'Документ планирования'; uk = 'Документ планування'"), ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Документы);

		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
		
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сценарий", НСтр("ru = 'Сценарий'; uk = 'Сценарій'") );
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВидДенежныхСредств", НСтр("ru = 'Вид денежных средств (наличные, безналичные)'; uk = 'Вид грошових засобів (готівкові, безготівкові)'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ПриходРасход", НСтр("ru = 'Вид движения'; uk = 'Вид руху'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ВалютаДенежныхСредств", НСтр("uk = 'Валюта руху'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СтатьяДвиженияДенежныхСредств", НСтр("ru = 'Статья движения денежных средств'; uk = 'Стаття руху грошових коштів'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Проект", НСтр("ru = 'Проект'; uk = 'Проект'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Контрагент", НСтр("ru = 'Контрагент'; uk = 'Контрагент'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДоговорКонтрагента", НСтр("ru = 'Договор контрагента'; uk = 'Договір контрагента'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Сделка", НСтр("ru = 'Сделка'; uk = 'Угода'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДокументПланирования", НСтр("ru = 'Документ планирования'; uk = 'Документ планування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Подразделение", НСтр("ru = 'Подразделение'; uk = 'Підрозділ'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПриходВал", НСтр("ru = 'Поступления в валюте планирования'; uk = 'Надходження у валюті планування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРасходВал", НСтр("ru = 'Платежи в валюте планирования'; uk = 'Платежі у валюті планування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДенежныйПотокВал", НСтр("ru = 'Чистый денежный поток в валюте планирования'; uk = 'Чистий грошовий потік у валюті планування'"));
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПриходУпр", НСтр("ru = 'Поступления в валюте упр. учета ('; uk = 'Надходження у валюті упр. обліку ('") + Константы.ВалютаУправленческогоУчета.Получить() + ")");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаРасходУпр", НСтр("ru = 'Платежи в валюте упр. учета ('; uk = 'Платежі у валюті упр. обліку ('") + Константы.ВалютаУправленческогоУчета.Получить() + ")");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ДенежныйПотокУпр", НСтр("ru = 'Чистый денежный поток в валюте упр. учета ('; uk = 'Чистий грошовий потік у валюті упр. обліку ('") + Константы.ВалютаУправленческогоУчета.Получить() + ")");
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаПриходВал", НСтр("ru = 'Поступления'; uk = 'Надходження'"), Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютепланирования", НСтр("ru = 'В валюте планирования'; uk = 'У валюті планування'"));
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРасходВал", НСтр("ru = 'Платежи'; uk = 'Платежі'"), Ложь, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютепланирования");
	УниверсальныйОтчет.ДобавитьПоказатель("ДенежныйПотокВал", НСтр("ru = 'Чистый денежный поток'; uk = 'Чистий грошовий потік'"), Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютепланирования");
	
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаПриходУпр", НСтр("ru = 'Поступления'; uk = 'Надходження'"), Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета", НСтр("ru = 'В валюте упр учета ('; uk = 'У валюті упр обліку ('") + Константы.ВалютаУправленческогоУчета.Получить() + ")");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаРасходУпр", НСтр("ru = 'Платежи'; uk = 'Платежі'"), Ложь, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета");
	УниверсальныйОтчет.ДобавитьПоказатель("ДенежныйПотокУпр", НСтр("ru = 'Чистый денежный поток'; uk = 'Чистий грошовий потік'"), Истина, "ЧЦ = 15 ; ЧДЦ = 2", "ВВалютеУпрУчета");
	
	// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("СтатьяДвиженияДенежныхСредств");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Сценарий");
	УниверсальныйОтчет.ДобавитьОтбор("Проект");
	УниверсальныйОтчет.ДобавитьОтбор("Подразделение");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДаннымРодитель>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>, <Размещение>, <Положение>);
	
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Приход", Перечисления.ВидыДвиженийПриходРасход.Приход);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Расход", Перечисления.ВидыДвиженийПриходРасход.Расход);

	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
